Autodesk.Revit.DB.Material.GetIdentityParameterIds
Gets material identity parameter ids from the material.
Since:
2027

Autodesk.Revit.DB.Material.EmbodiedCarbonAssetId
The ElementId of the embodied carbon PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027